---
type: FamilyLoadingIntoDocumentEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 2
tags: [revit-api, class]
---

# FamilyLoadingIntoDocumentEventArgs

`Autodesk.Revit.DB.Events.FamilyLoadingIntoDocumentEventArgs` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | FamilyName | 2015 | `public string FamilyName { get ; }` |
| Property | FamilyPath | 2015 | `public string FamilyPath { get ; }` |